app/controllers/autograder_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."email" = ? AND "scores"."name" = ? AND "scores"."week" = ?  [["email", "paulsyq@gmail.com"], ["name", "Paul Shao"], ["week", 2]]
SELECT  1 AS one FROM "scores" WHERE "scores"."email" = ? AND "scores"."name" = ? AND "scores"."week" = ? LIMIT ?  [["email", "paulsyq@gmail.com"], ["name", "Paul Shao"], ["week", 2], ["LIMIT", 1]]
INSERT INTO "scores" ("email", "name", "week", "total_test", "passed_test", "total_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def import_lab
      begin
        week = params["labweek"]
        week_number = week[-1].to_i
        user_email = current_user.email
        user_name = current_user.name
        if params[:labfile].nil? or params[:labfile].length == 0
          flash[:notice] = "Warning: Please Make Sure the Lab Submission File is Uploaded."
          redirect_to :controller => 'course', :action => 'score'
        else
          filepath = params[:labfile][0].path
          secret_codeword = @@lab_codes_by_week[week]
          value = `python "./Autograder/lab_check.py" #{filepath} #{secret_codeword}`
          result = value.split("\n")[0]
          curr_record = Score.where(email: user_email, name: user_name, week: week_number, assignment: "lab")
          if result == 'True'
            if curr_record.any?
              curr_record[0].total_test = 1
              curr_record[0].passed_test = 1
              curr_record[0].total_score = 100
              curr_record[0].save
            else
              Score.create(
                  :email => user_email,
                  :name => user_name,
                  :week => week_number,
                  :assignment => "lab",
                  :total_test => 1,
                  :passed_test => 1,
                  :total_score => 100
              )

SELECT  "scores".* FROM "scores" WHERE "scores"."email" = ? AND "scores"."name" = ? AND "scores"."week" = ? ORDER BY "scores"."id" ASC LIMIT ?  [["email", "paulshaoyuqiao@gmail.com"], ["name", "Shao Yuqiao Paul"], ["week", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "scores" WHERE "scores"."email" = ? AND "scores"."name" = ? AND "scores"."week" = ? LIMIT ?  [["email", "paulsyq@gmail.com"], ["name", "Paul Shao"], ["week", 2], ["LIMIT", 1]]
---
            @total_test_cases = @@total_tests_by_week[week]
            @week_name = week
            overall_score = AutograderController.generate_score(@total_test_cases, @passed_test_cases)
            curr_record = Score.where(email: user_email, name: user_name, week: week_number, assignment: "homework")
            if curr_record.any?

INSERT INTO "scores" ("email", "name", "week", "total_test", "passed_test", "total_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
              curr_record[0].total_score = overall_score
              curr_record[0].save
            else
              Score.create(
                  :email => user_email,
                  :name => user_name,
                  :week => week_number,
                  :assignment => "homework",
                  :total_test => @total_test_cases,
                  :passed_test => @passed_test_cases,
                  :total_score => overall_score
              )