app/controllers/course_controller.rb

    def score
        @user_score = nil
        unless current_user.nil?
            @user_score = Score.where(email: current_user.email)
---
SELECT  "scores".* FROM "scores" WHERE "scores"."email" = ? LIMIT ?  [["email", "paulshaoyuqiao@gmail.com"], ["LIMIT", 1]]